export const paintColorsBrightness = ["#ffffff", "#9f9f9f", "#000000"] as const;

export const topRowColors = [
  "#FF00FF", // Ярко-розовый
  "#FF00BF", // Ярко-красный
  "#FF0000", // Красный
  "#FF7F00", // Оранжевый
  "#FFFF00", // Желтый
  "#BFFF00", // Лаймовый
  "#00FF00", // Зеленый
  "#00FF7F", // Зеленовато-голубой
  "#00FFFF", // Голубой
  "#007FFF", // Сине-голубой
  "#0000FF", // Синий
  "#7F00FF", // Фиолетовый
] as const;

export const middleRowColors = [
  "#FF7FFF", // Светло-розовый
  "#FF7F9F", // Светло-красный
  "#FF7F7F", // Светло-красный
  "#FFBF7F", // Светло-оранжевый
  "#FFFF7F", // Светло-желтый
  "#BFFF7F", // Светло-зеленый
  "#7FFF7F", // Светло-зеленый
  "#7FFF9F", // Светло-аквамариновый
  "#7FFFFF", // Светло-голубой
  "#7F9FFF", // Светло-небесно-синий
  "#7F7FFF", // Светло-синий
  "#BF7FFF", // Светло-фиолетовый
] as const;

export const bottomRowColors = [
  "#7F007F", // Темно-розовый
  "#7F003F", // Темно-красный
  "#7F0000", // Темно-красный
  "#7F3F00", // Темно-оранжевый
  "#7F7F00", // Темно-желтый
  "#3F7F00", // Темно-зеленый
  "#007F00", // Темно-зеленый
  "#007F3F", // Темно-аквамариновый
  "#007F7F", // Темно-голубой
  "#003F7F", // Темно-небесно-синий
  "#00007F", // Темно-синий
  "#3F007F", // Темно-фиолетовый
] as const;

export const darkColors = [...bottomRowColors, "#000000"];
